validation/baseline/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.5;

vertices (
    (-20 -15 0) //0
    (40 -15 0) //1
    (40 15 0) //2
    (-20 15 0) //3
    (-20 -15 15) //4
    (40 -15 15) //5
    (40 15 15) //6
    (-20 15 15) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 40 20) simpleGrading (((0.275 0.2 0.2)(0.15 0.4 1)(0.575 0.4 5)) ((0.3875 0.25 0.2)(0.225 0.5 1)(0.3875 0.25 5)) ((0.35 0.6 1)(0.65 0.4 5)))
);

edges
(
);

boundary
(
    side
    {
        type patch;
        faces
        (
			(4 5 6 7)
            (3 7 6 2)
            (1 5 4 0)			
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
	symmetry
	{
	    type symmetryPlane;
        faces
        (
			(0 3 2 1)
        );
	}
);

mergePatchPairs
(
);


// ************************************************************************* //
